{
    "animation": "La propiedad <code>animation</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a>es una abreviatura para la propiedad <code><a href=\"https://developer.mozilla.org/CSS/animation-name\">animation-name</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/animation-duration\">animation-duration</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/animation-timing-function\">animation-timing-function</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/animation-delay\">animation-delay</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/animation-iteration-count\">animation-iteration-count</a></code> y <code><a href=\"https://developer.mozilla.org/CSS/animation-direction\">animation-direction</a></code>.",
    "animation-delay": "La propiedad <code>animation-delay</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> especifica cuándo debería empezar la animación. Esto permite que la secuencia de la animación empiece poco después de que se aplique al elemento.",
    "animation-direction": "La propiedad CSS <code>animation-direction</code> indica si la animación se debería reproducir al revés en ciclos alternados.",
    "animation-duration": "La propiedad CSS <code>animation-duration</code> especifica el tiempo que debería tomar una animación para completar un ciclo.",
    "animation-iteration-count": "La propiedad <code>animation-iteration-count</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> define cuántas veces el ciclo de una animación debería reproducirse antes de pararse.",
    "animation-name": "La propiedad <code>animation-name</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> especifica una lista de animaciones que deberían aplicarse al elemento seleccionado. Cada nombre indica un <code><a href=\"https://developer.mozilla.org/CSS/@keyframes\">@keyframes</a></code> de la regla \"@\" que define los valores de la propiedad para la secuencia de la animación.",
    "animation-play-state": "La propiedad <code>animation-play-state</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> determina si una animación se está ejecutando o está en pausa. Puedes consultar el valor de esta propiedad para saber si la animación se está ejecutando en este momento. Además, puedes definir sus valores para pausar y reanudar la reproducción de la animación.",
    "animation-timing-function": "La propiedad <a href=\"https://developer.mozilla.org/CSS\">CSS</a>, <code>animation-timing-function</code>, especifica como una animación CSS debe avanzar en el tiempo de duración de cada ciclo. Los posibles valores pueden ser uno o muchos. <span><code><a href=\"https://developer.mozilla.org/CSS/timing-function\">&lt;timing-function&gt;</a></code> </span>.",
    "azimuth": "El <code>azimuth</code>, en combinación con <code>elevation</code>, permite que se sitúen en el espacio diferente fuentes de audio para presentaciones auditivas. Esto es importante porque permite distinguir varias voces de forma natural, ya que cada una se puede posicionar en un lugar diferente del escenario. La salida stereo produce un escenario lateral, mientras que los audífonos biaural y la disposición de múltiples bocinas permite un escenario completamente tridimensional.",
    "backface-visibility": "La propiedad <code>backface-visibility</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> determina si el lado posterior del elemento es visible cuando este está de cara al usuario. El lado posterior de un elemento es siempre un fondo transparente que permite, cuando es visible, mostrar el reflejo del lado frontal.",
    "background": "La propiedad <code>background</code> de CSS es una abreviatura para establecer los valores individuales del fondo en un solo lugar en la hoha de estilos. <code>background</code> puede usarse para establecer los valores de una o más de las propiedades: <code><a href=\"https://developer.mozilla.org/CSS/background-color\">background-color</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/background-image\">background-image</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/background-position\">background-position</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/background-repeat\">background-repeat</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/background-size\">background-size</a></code>, y <code><a href=\"https://developer.mozilla.org/CSS/background-attachment\">background-attachment</a></code>.",
    "background-attachment": "Si se especifica <code><a href=\"https://developer.mozilla.org/CSS/background-image\">background-image</a></code>, la propiedad <code>background-attachment</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> determina si la posición de esa imagen es fija en el área de visualización o de desplaza con el bloque que la contiene.",
    "background-clip": "La propiedad CSS <code>background-clip</code> especifica si el fondo de un elemento, sea este el color o la imagen, se extiende por debajo de su borde.",
    "background-color": "La propiedad <code>background-color</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> define el color de fondo de un elemento, a través del valor del color o a través de la palabra clave <code>transparent</code>.",
    "background-image": "La propiedad CSS <code>background-image</code> define las imágenes de fondo para un elemento. Las imágenes se dibujan en capas de contexto sucesivas y apiladas, con la primera que se dibuja como si fuera la más cercana al usuario. El <a href=\"https://developer.mozilla.org/CSS/border\">borders</a> de un elemento luego se dibujan arriba de ellos, y el <code><a href=\"https://developer.mozilla.org/CSS/background-color\">background-color</a></code> se dibuja abajo de ellos.",
    "background-origin": "La propiedad <code>background-origin</code> de CSS determina el área de posicionamiento del fondo, que es la posición del origen de una imagen especificada mediante la propiedad <code><a href=\"https://developer.mozilla.org/CSS/background-image\">background-image</a></code> de CSS.",
    "background-position": "La propiedad CSS <code>background-position</code> define la posición inicial relativa a la posición de la capa del fondo que se define con <code><a href=\"https://developer.mozilla.org/CSS/background-origin\">background-origin</a></code> para cada imagen de fondo definida.",
    "background-repeat": "La propiedad <code>background-repeat</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> define cómo se repiten las imágenes de fondo. Una  imagen de fondo se puede repetir a lo largo del eje horizontal, vertical o ambos, o no repetirse para nada. Cuando la repetición de los mosaicos de la imagen no permite que se cubra con exactitud el fondo, el autor puede controlar cómo hacer los ajustes. Por defecto, se recorta la última imagen, pero, en su lugar, es posible ajustar el tamaño de los diferentes mosaicos, o se puede insertar un espacio entre los mosaicos.",
    "background-size": "La propiedad <code>background-size</code> de CSS  especifica el tamaño de las imágenes de fondo.",
    "bleed": "Esta propiedad especifica la extensión del área de sangrado de la página afuera de la caja de la página. Esta propiedad funciona solo se las marcas de recortes están activadas.",
    "border": "La propiedad <code>border</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> es una propiedad abreviada para definir los valores individuales de la propiedad del borde en un espacio único en la hoja de estilo. Se puede usar <code>border</code> para definir los valores para una o más de las siguientes: <code><a href=\"https://developer.mozilla.org/CSS/border-width\">border-width</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/border-style\">border-style</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/border-color\">border-color</a></code>.",
    "border-bottom": "La propiedad <code>border-bottom</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> es una abreviatura que establece los valores de <code><a href=\"https://developer.mozilla.org/CSS/border-bottom-color\">border-bottom-color</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/border-bottom-style\">border-bottom-style</a></code>, and <code><a href=\"https://developer.mozilla.org/CSS/border-bottom-width\">border-bottom-width</a></code>. Estas propiedades describen el borde inferior de los elementos.",
    "border-bottom-color": "La propiedad CSS <code>border-bottom-color</code> establece el color del borde inferior de un elemento. En la mayoría de los casos las propiedades CSS abreviadas <code><a href=\"https://developer.mozilla.org/CSS/border-color\">border-color</a></code> o <code><a href=\"https://developer.mozilla.org/CSS/border-bottom\">border-bottom</a></code> son más convenientes y es preferible su uso.",
    "border-bottom-left-radius": "La propiedad CSS <code>border-bottom-left-radius</code> define el redondeo de la esquina inferior izquierda del elemento. El redondeo puede ser circular o elíptico; si uno de los valores es <code>0</code>, entonces no habrá redondeo y la esquina será cuadrada.",
    "border-bottom-right-radius": "La propiedad CSS <code>border-bottom-right-radius</code> establece el redondeo de la esquina inferior derecha del elemento. El redondeo puede ser circular o elíptico; si  uno de los valores es <code>0</code> no se redondea, entonces la esquina será cuadrada.",
    "border-bottom-style": "La propiedad <code>border-bottom-style</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> define el estilo de línea del borde inferior de la caja.",
    "border-bottom-width": "La propiedad <code>border-bottom-width</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> define el ancho del borde inferior de la caja.",
    "border-collapse": "La propiedad CSS <code>border-collapse</code> selecciona el modelo del borde de la tabla. Tiene mucha influencia sobre la imagen y el estilo de las celdas de la tabla.",
    "border-color": "La propiedad CSS <code>border-color</code> es una abreviatura para establecer el color de los cuatro lados del borde de un elemento: <code><a href=\"https://developer.mozilla.org/CSS/border-top-color\">border-top-color</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/border-right-color\">border-right-color</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/border-bottom-color\">border-bottom-color</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/border-left-color\">border-left-color</a></code>",
    "border-image": "La propiedad CSS <code>border-image</code> permite que se dibuje una imagen en el borde de los elementos. Esto simplifica el dibujo de widgets complejos y elimina la necesidad del utilizo, en algunos casos, de nueve cajas. ",
    "border-image-outset": "Lapropiedad <code>border-image-outset</code> describe en que cantidad, el <dfn> área del borde de la imagen</dfn> se extiende más allá del borde del contenedor.",
    "border-image-repeat": "La propiedad CSS <code>border-image-repeat</code> define cómo se maneja la parte mediana de la imagen del borde para que esta coincida con la medida del borde. La sintaxis de un valor describe el comportamiento de todos los lados y la sintaxis de dos valores define un valor diferente para el comportamiento horizontal y vertical.",
    "border-image-source": "La propiedad CSS <code>border-image-source</code> define <code><a href=\"https://developer.mozilla.org/CSS/image\">&lt;image&gt;</a></code> que se usa en lugar del estilo del borde. Si se define esta propiedad en <code>none</code>, se usa en su lugar el estilo definido por <code><a href=\"https://developer.mozilla.org/CSS/border-style\">border-style</a></code>.",
    "border-image-width": "La propiedad CSS <code>border-image-width</code> define el desplazamiento para dividir la imagen del borde en nueve partes, la esquina superior izquierda, la parte superior central, la esquina superior derecha, la parte central derecha, la esquina inferior derecha, la parte inferior central, la esquina inferior izquierda y la parte central derecha. Representan la distancia hacia el interior desde los bordes superior, derecho, inferior y derecho. ",
    "border-left": "La propiedad <code>border-left</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> es una abreviatura que define los valores de <code><a href=\"https://developer.mozilla.org/CSS/border-left-color\">border-left-color</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/border-left-style\">border-left-style</a></code> y <code><a href=\"https://developer.mozilla.org/CSS/border-left-width\">border-left-width</a></code>. Estas propiedades describen el borde izquierdo de los elementos.",
    "border-left-color": "La propiedad CSS <code>border-left-color</code> establece el color del borde izquierdo de un elemento. En la mayoría de los casos las propiedades CSS abreviadas <code><a href=\"https://developer.mozilla.org/CSS/border-color\">border-color</a></code> o <code><a href=\"https://developer.mozilla.org/CSS/border-left\">border-left</a></code> son más convenientes y es preferible su uso.",
    "border-left-style": "La propiedad <code>border-left-style</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> define el estilo de la línea del lado izquierdo de la caja.",
    "border-left-width": "La propiedad <code>border-left-width</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> define el ancho del borde izquierdo de la caja.",
    "border-radius": "La propiedad <code>border-radius</code> de CSS permite a los creadores de sitios Web definir como redondear el borde de las esquinas. La curva de cada esquina se define usando uno o dos radios, determinando su forma: circulo o elipce.",
    "border-right": "La propiedad <code>border-right</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> es una abreviatura que establece los valores de <code><a href=\"https://developer.mozilla.org/CSS/border-right-color\">border-right-color</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/border-right-style\">border-right-style</a></code>, y <code><a href=\"https://developer.mozilla.org/CSS/border-right-width\">border-right-width</a></code>. Estas propiedades describen el borde derecho de los elementos.",
    "border-right-color": "La propiedad CSS <code>border-right-color</code> establece el color del borde derecho de un elemento. En la mayoría de los casos las propiedades CSS abreviadas <code><a href=\"https://developer.mozilla.org/CSS/border-color\">border-color</a></code> o <code><a href=\"https://developer.mozilla.org/CSS/border-right\">border-bottom</a></code> son más convenientes y es preferible su uso.",
    "border-right-style": "La propiedad <code>border-right-style</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> define el estilo de la línea del borde derecho de la caja.",
    "border-right-width": "La propiedad <code>border-right-width</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> define el ancho del borde derecho de la caja.",
    "border-spacing": "La propiedad CSS <code>border-spacing</code> especifica la distancia entre los bordes de la celdas adyacentes (solo para <a href=\"https://developer.mozilla.org/CSS/border-collapse\">separated borders model</a>). Esto es equivalente al atributo <code>cellspacing</code> de HTML de presentación, pero se puede usar un segundo valor opcional para definir diferentes espacios horizontales y verticales.",
    "border-style": "La propiedad <code>border-style</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> es una propiedad abreviada que define el estilo de la línea para los cuatro lados del borde de los elementos.",
    "border-top": "La propiedad code>border-top</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> es una abreviatura que establece los valores de <code><a href=\"https://developer.mozilla.org/CSS/border-top-color\">border-top-color</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/border-top-style\">border-top-style</a></code>, y <code><a href=\"https://developer.mozilla.org/CSS/border-top-width\">border-top-width</a></code>. \nEstas propiedades describen el borde superior de los elementos.",
    "border-top-color": "La propiedad CSS <code>border-top-color</code> establece el color del borde superior de un elemento. En muchos casos, es más conveniente  y preferible el uso de las propiedades CSS abreviadas <code><a href=\"https://developer.mozilla.org/CSS/border-color\">border-color</a></code> or <code><a href=\"https://developer.mozilla.org/CSS/border-top\">border-top</a></code> ",
    "border-top-left-radius": "La propiedad CSS <code>border-top-left-radius</code> define el redondeo de la esquina superior izquierda del elemento. El redondeo puede ser circular o elíptico; si uno de los valores es <code>0</code>, entonces no habrá redondeo y la esquina será cuadrada.",
    "border-top-right-radius": "La propiedad CSS <code>border-top-right-radius</code> define el redondeo de la esquina izquierda superior del elemento. El redondeo puede ser circular o elíptico; si uno de los valores es <code>0</code>, entonces no habrá redondeo y la esquina será cuadrada.",
    "border-top-style": "La propiedad <code>border-top-style</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> define el estilo de la línea del borde superior de la caja.",
    "border-top-width": "La propiedad <code>border-top-width</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> define el ancho del borde superior de la caja.",
    "border-width": "La propiedad CSS <code>border-width</code> define el ancho del borde de la caja. Resulta más eficaz usar la propiedad abreviada <code><a href=\"https://developer.mozilla.org/CSS/border\">border</a></code>.",
    "bottom": "La propiedad <code>bottom</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> participa en especificar la posición de los <em>elementos posicionados</em>.",
    "box-shadow": "La propiedad CSS <code>box-shadow</code> acepta uno o más efectos de sombras como una lista separada por commas. Permite trazar una sombra paralela desde el marco de casi todos los elementos. Si se especifica <code><a href=\"https://developer.mozilla.org/CSS/border-radius\">border-radius</a></code> en un elemento con una caja de sombre, esta adopta el mismo redondeo de las esquinas. El orden z de múltiples cajas de sombras es el mismo que múltiples <a href=\"https://developer.mozilla.org/CSS/text-shadow\">text shadows</a> (la primera sombra que se especifica se encuentra arriba.)",
    "box-sizing": "La propiedad CSS <code>box-sizing</code> se usa para alterar el modelo de la caja CSS predeterminado para calcular el ancho y la altura de los elementos. Es posible utilizar esta propiedad para emular el comportamiento de los navegadores que actualmente no son compatibles la especificación del modelo de la caja CSS.",
    "caption-side": "La propiedad <code>caption-side</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> posiciona el contenido <code><a href=\"https://developer.mozilla.org/HTML/Element/caption\">&lt;caption&gt;</a></code> de la tabla en un lado específico.",
    "clear": "La propiedad <code>clear</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> especifica si un elemento puede estar al lado de elementos <a href=\"https://developer.mozilla.org/CSS/float\">floating</a> que lo preceden o debe ponerse (borrarse) abajo de ellos.",
    "clip": "La propiedad CSS <code>clip</code> define qué porción de un elemento es visible. La propiedad <code>clip</code> aplica solo al elemento con <code><a href=\"https://developer.mozilla.org/CSS/position\">position:absolute</a></code>.",
    "color": "La propiedad CSS <code>color</code> define el color de primer plano del contenido del texto del elemento.",
    "column-count": "La propiedad CSS <code>column-count</code> describe el número de columnas del elemento.",
    "column-fill": "La propiedad <code>column-fill</code> de CSS controla cómo el contenido se divide en columnas. El contenido está bien equilibrado, lo que significa que el contenido en todas las columnas tiene la misma altura o, al utilizar <code>auto</code>, sólo ocupan el espacio que el contenido necesita.",
    "column-gap": "La propiedad <code>column-gap</code> de CSS establece el tamaño del espacio entre las columnas para los elementos que se especifican para visualizarse como un elemento de varias columnas",
    "column-rule": "En diseños de varias columnas, la propiedad CSS <code>column-rule</code> CSS  especifica una línea recta o \"regla\" que se traza entre cada columna. Es un metodo rápido y conveniente para evitar establecer cada una de las propiedades <code>column-rule-*</code> por separado: <code><a href=\"https://developer.mozilla.org/CSS/column-rule-width\">column-rule-width</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/column-rule-style\">column-rule-style</a></code> y <code><a href=\"https://developer.mozilla.org/CSS/column-rule-color\">column-rule-color</a></code>.",
    "column-rule-color": "La propiedad CSS <code>column-rule-color</code> permite definir el color de la regla dibujada entre las columnas en un formato con múltiples columnas.",
    "column-rule-style": "La propiedad CSS <code>column-rule-style</code> permite definir el estilo de la regla dibujada entre las columnas en un diseño de múltiples columnas. ",
    "column-rule-width": "La propiedad CSS <code>column-rule-width</code> permite establecer el ancho de la regla dibujada entre las columnas en un diseño de múltiples columnas.",
    "column-span": "La propiedad <code>column-span</code> de CSS hace posible que un elemento se extienda por todas las columnas cuando su valor se establece en <code>all</code>. Un elemento que se extiende por más de una columna es llamado <strong>elemento  extendido</strong>.",
    "column-width": "La propiedad CSS <code>column-width</code> sugiere el ancho optimal de la columna. Este no es un valor absoluto, solo una pista. El navegador ajustará el ancho de la columna alrededor del valor sugerido para obtener diseños escalables que caben en pantallas de diferentes medidas. Se deben especificar todos los valores de longitud, sobre todo en presencia de la propiedad CSS <code><a href=\"https://developer.mozilla.org/CSS/column-count\">column-count</a></code> que tiene prioridad para definir el ancho exacto de la columna. En los textos horizontales estos  son los siguientes:  <code><a href=\"https://developer.mozilla.org/CSS/width\">width</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/column-width\">column-width</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/column-gap\">column-gap</a></code> y <code><a href=\"https://developer.mozilla.org/CSS/column-rule-width\">column-rule-width</a></code>.",
    "columns": "La propiedad <code>columns</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> es una a propiedad abreviada que permite establecer al mismo tiempo las propiedades de <code><a href=\"https://developer.mozilla.org/CSS/column-width\">column-width</a></code> y <code><a href=\"https://developer.mozilla.org/CSS/column-count\">column-count</a></code>.",
    "content": "La propiedad CSS <code>content</code> se usa con los seudoelementos <code><a href=\"https://developer.mozilla.org/CSS/%3Abefore\">:before</a></code> y <code><a href=\"https://developer.mozilla.org/CSS/%3Aafter\">:after</a></code> para generar contenido en un elemento.",
    "counter-increment": "La propiedad <code>counter-increment</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> se usa para incrementar el valor <a href=\"https://developer.mozilla.org/CSS_Counters\">CSS Counters</a> de un valor dado.  El contravalor puede restablecerse usando la propiedad CSS <code><a href=\"https://developer.mozilla.org/CSS/counter-reset\">counter-reset</a></code>.",
    "counter-reset": "La propiedad <code>counter-reset</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> se usa para restablecer <a href=\"https://developer.mozilla.org/CSS_Counters\">CSS Counters</a> a un valor dado.",
    "cursor": "La propiedad CSS <code>cursor</code> especifica que se muestre el cursor del ratón cuando el puntero de este está arriba de un elemento.",
    "direction": "La propiedad CSS <code>direction</code> debería definirse para coincidir con la dirección del texto: <code>rtl</code> para el texto en hebreo o árabe y <code>ltr</code> para otras escrituras. Esto suele hacerse como parte del documento (por ejemplo usando el atributo <code>dir</code> en HTML) en lugar de usar CSS directamente.",
    "display": "La propiedad CSS <code>display</code> especifica el tipo de representación de la caja para un elemento. En HTML, los valores predeterminados de <code>display</code> se toman de comportamiento descritos en las especificaciones HTML o de la hoja de estilo predeterminada del navegador o usuario. El valor predeterminado en XML es <code>inline</code>.",
    "empty-cells": "La propiedad CSS <code>empty-cells</code> especifica cómo el agente de usuario debería representar los bordes y los fondos alrededor de las celdas sin contenido visible.",
    "float": "La propiedad CSS <code>float</code> especifica que se debería tomar un elemento del flujo normal y ponerlo a lo largo del lado izquierdo o derecho de su contenedor, donde el texto y los elementos alineados se ajustarán a su alrededor.",
    "font": "La propiedad <code>font</code> de CSS se refiere a la propiedad abreviada para establecer <code><a href=\"https://developer.mozilla.org/CSS/font-style\">font-style</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/font-variant\">font-variant</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/font-weight\">font-weight</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/font-size\">font-size</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/line-height\">line-height</a></code> y <code><a href=\"https://developer.mozilla.org/CSS/font-family\">font-family</a></code>, o una manera de establecer la fuente del elemento a una fuente del sistema, utilizando palabras clave específicas.",
    "font-family": "La propiedad CSS <code>font-family</code> permite que se especifique una lista priorizada de nombres de familias de fuentes y/o nombres genéricos de familias para el elemento seleccionado. A diferencia de casi todas las demás propiedades CSS, los valores están separados por una comma para indicar que utilizan alternativas. El navegador usará la primera letra de la lista que está instalada en la computadora, o esta se puede descargar usando la información en la regla \"@\" con <code><a href=\"https://developer.mozilla.org/CSS/@font-face\">@font-face</a></code>.",
    "font-size": "La propiedad <code>font-size</code> <a href=\"https://developer.mozilla.org/CSS\">CSS</a> especifica el tamaño de la fuente. A su vez, la letra puede cambiar el tamaño de otros elementos ya que esta se usa para calcular el valor de las unidades longitudinales <code>em</code> y <code>ex</code>.",
    "font-size-adjust": "La propiedad CSS <code>font-size-adjust</code> especifica que se debería escoger el tamaño de la fuente en base a la altura de las letras minúsculas en lugar que a la de la letras mayúsculas.",
    "font-stretch": "La propiedad CSS <code>font-stretch</code> selecciona la tipografía normal, condensada o extendida de una familia de fuentes.",
    "font-style": "La propiedad CSS <code>font-style</code> permite seleccionar la tipografía <code>italic</code> u <code>oblique</code> dentro de <code><a href=\"https://developer.mozilla.org/CSS/font-family\">font-family</a></code>.<br>",
    "font-variant": "La propiedad CSS <code>font-variant</code> selecciona el tipo de fuente <code>normal</code> o <code>small-caps</code> de una familia tipográfica. Es también posible definir <code>font-variant</code> usando la abreviatura code><a href=\"https://developer.mozilla.org/CSS/font\">font</a></code>.",
    "font-weight": "La propiedad <code><a href=\"https://developer.mozilla.org/CSS/font-weight\">font-weight</a></code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> especifica el peso o el atributo de negrita de la fuente. Sin embargo, algunas fuentes no están disponibles en todos los pesos; alguno solo están disponibles en <code>normal</code> y <code>bold</code>.",
    "height": "La propiedad CSS <code>height</code> especifica la altura del área del contenido de un elemento. El <a href=\"https://developer.mozilla.org/CSS/box_model#content\">content area</a> está <em>adentro</em> del espaciado, borde y margen del elemento.",
    "hyphens": "La propiedad <code>hyphens</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> le dice al navegador cómo recortar palabras para mejorar al disposición del texto cuando hay un ajuste de línea. ",
    "image-rendering": "La propiedad <code>image-rendering</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> proporciona una pista al agente de usuario sobre cómo manejar la representación de la imagen. El <br> <code>image-rendering</code> aplica a las imágenes ajustadas y a otros elementos (ver más abajo). Por ejemplo, si la medida normal de la imagen es de <em> 100×100px </em>, pero al autor de la página especifica que las dimensiones son de <code>200×200px</code> (o <code>50×50px</code>), entonces la imagen se agrandará (o se achicará) según las nuevas dimensiones, usando un algoritmo especifico. El ajuste de la medida se puede llevar a cabo también por la interacción del usuario (ampliación).",
    "left": "La propiedad CSS <code>left</code> especifica una parte de la posición de los elementos posicionados",
    "letter-spacing": "La propiedad CSS <code>letter-spacing</code> especifica el comportamiento del espacio entre los caracteres del texto.",
    "line-height": "En los elementos alineados, la propiedad CSS <code>line-height</code> especifica la altura que se utiliza en el cálculo de la altura de la caja de la línea. En los elementos a nivel de bloque, <code>line-height</code> especifica la altura mínima de las cajas de la línea dentro del elemento.",
    "list-style": "La propiedad CSS <code>list-style</code> es una propiedad abreviada para definir <code><a href=\"https://developer.mozilla.org/CSS/list-style-type\">list-style-type</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/list-style-image\">list-style-image</a></code> y <code><a href=\"https://developer.mozilla.org/CSS/list-style-position\">list-style-position</a></code>.",
    "list-style-image": "La propiedad <code>list-style-image</code> de CSS establece la imagen que se usará como marcador al elemento de la lista. A menudo es más conveniente utilizar el método abreviado <code><a href=\"https://developer.mozilla.org/CSS/list-style\">list-style</a></code>.",
    "list-style-position": "La propiedad CSS <code>list-style-position</code> establece la posición del marcador de un elemento de la lista, con respecto al bloque principal, es comúnmente más conveniente usar pa propiedad abreviada <span><code><a href=\"https://developer.mozilla.org/CSS/list-style\">list-style</a></code></span>.",
    "list-style-type": "La propiedad <code>list-style-type</code> de CSS especifica la apariencia de un elemento de la lista. Ya que por defecto es <code>display:list-item</code>, por lo general este es el elemento <code><a href=\"https://developer.mozilla.org/HTML/Element/li\">&lt;li&gt;</a></code> sin embargo puede ser cualquier otro elmento con este valor <code><a href=\"https://developer.mozilla.org/CSS/display\">display</a></code>",
    "margin": "La propiedad CSS <code>margin</code> define el margen para los cuatro lados. Esta es una abreviatura para evitar definir cada lado por separado con las propiedades del otro margen: <br><code><a href=\"https://developer.mozilla.org/CSS/margin-top\">margin-top</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/margin-right\">margin-right</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/margin-bottom\">margin-bottom</a></code> y <code><a href=\"https://developer.mozilla.org/CSS/margin-left\">margin-left</a></code>.<br>No se permiten valores negativos.",
    "margin-bottom": "La propiedad <code>margin-bottom</code> <a href=\"https://developer.mozilla.org/CSS\">CSS</a> de un elemento define el espacio del margen que se requiere en la parte inferior del elemento. Se permite también un valor negativo.",
    "margin-left": "La propiedad <code>margin-left</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> de un elemento define el espacio del margen que se requiere en el lado izquierdo de un elemento. Se permite también un valor negativo.",
    "margin-right": "La propiedad <code>margin-right</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> de un elemento define el espacio del margen que se requiere en el lado derecho de un elemento. Se permite también un valor negativo.",
    "margin-top": "La propiedad CSS <code>margin-top</code> de un elemento define el espacio del margen que se requiere en la parte superior de un elemento. Se permite también un valor negativo.",
    "marker-offset": "La propiedad <code>marker-offset</code> define la distancia entre los límites más cercanos del borde de un marcador y su caja principal asociada.",
    "marks": "La propiedad <code>marks</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> añade recortes y/o cruces a la presentación del documento. Las <em>marcas de recorte</em> indican dónde se tiene que cortar la página. Las <em>marcas de cruces</em> se usan para alienar las hojas.",
    "max-height": "La propiedad CSS <code>max-height</code> se utiliza para establecer la altura máxima de un elemento dado. Esta evita que el valor utilizado de la propiedad <code><a href=\"https://developer.mozilla.org/CSS/height\">height</a></code> llegue a ser mayor que el valor especificado para <code>max-height</code>.",
    "max-width": "La propiedad CSS <code>max-width</code> se utiliza para establecer el ancho máximo de un elemento dado. Esta evita que el valor utilizado de la propiedad <code><a href=\"https://developer.mozilla.org/CSS/width\">width</a></code> llegue a ser mayor que el valor especificado para <code>max-width</code>.",
    "min-height": "La propiedad CSS <code>min-height</code> CSS se utiliza para establecer la altura mínima de un elemento dado. Esta evita que el valor utilizado de la propiedad <code><a href=\"https://developer.mozilla.org/CSS/height\">height</a></code> llegue a ser menor que el valor especificado para <code>min-height</code>.",
    "min-width": "La propiedad CSS <code>min-width</code> se utiliza para establecer el ancho mínimo de un elemento dado. Esta evita que el valor utilizado de la propiedad <code><a href=\"https://developer.mozilla.org/CSS/width\">width</a></code> llegue a ser menor que el valor especificado para <code>min-width</code>.",
    "opacity": "La propiedad CSS <code>opacity</code> especifica la transparencia de un elemento, o sea el grado de superposición del fondo detrás del elemento.",
    "orphans": "La propiedad <a href=\"https://developer.mozilla.org/CSS\">CSS</a>,  <code>orphans</code>,  establece el <em>mínimo</em> número de lineas en un contenedor de bloque que deben ser dejados al final de la página. Esta propiedad es usada comunmente para controlar la manera en la que ocurren los saltos de línea.",
    "outline": "La propiedad CSS <code>outline</code> es una propiedad abreviada que define en una sola regla una o más de las propiedades individuales del contorno <code><a href=\"https://developer.mozilla.org/CSS/outline-style\">outline-style</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/outline-width\">outline-width</a></code> and <code><a href=\"https://developer.mozilla.org/CSS/outline-color\">outline-color</a></code>. En la mayoría de los casos es preferible y más conveniente usar esta abreviatura. ",
    "outline-color": "La propiedad CSS <code>outline-color</code> define el color del contorno de un elemento. El contorno es una línea que se traza alrededor de los elementos —afuera del borde— para que el elemento resalte.",
    "outline-offset": "La propiedad CSS <code>outline-offset</code> se usa para definir el espacio entre un <code><a href=\"https://developer.mozilla.org/CSS/outline\">outline</a></code> y el límite o el borde de un elemento. El contorno es una línea que se traza alrededor de los elementos, afuera del límite del borde.",
    "outline-style": "La propiedad CSS <code>outline-style</code> se usa para definir el estilo del contorno de un elemento. El contorno es una línea que se traza alrededor del elemento —afuera del borde— para que el elemento resalte.",
    "outline-width": "La propiedad CSS <code>outline-width</code> es usado para fijar el ancho del contorno de un elemento. Un contorno es una linea que es dibujada alrededor de los elementos, al final del borde del mismo, que se usa comunmente para resaltarlos.",
    "overflow": "La propiedad CSS <code>overflow</code> especifica si recortar el contenido, representar las barras de desplazamiento, o mostrar el contenido que desborda de un elemento a nivel de bloque.",
    "overflow-x": "La propiedad <code>overflow-x</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> especifica si recortar el contenido, representar la barra de desplazamiento o mostrar el contenido que desborda del elemento a nivel de bloque cuando este sale de los límites derecho e izquierdo.",
    "padding": "La propiedad CSS <code>padding</code> define el espaciado que se requiere en todos los lados del elemento. El <a href=\"https://developer.mozilla.org/CSS/Box_model#padding\">padding area</a> es el espacio entre el contenido del elemento y su borde. No se permiten valores negativos.",
    "padding-bottom": "La propiedad <code>padding-bottom</code> <a href=\"https://developer.mozilla.org/CSS\">CSS</a> de un elemento define el espaciado que se requiere en la parte inferior de un elemento. El <a href=\"https://developer.mozilla.org/CSS/box_model#padding\">padding area</a> es el espacio entre el contenido del elemento y su borde. No se permite in valor negativo.",
    "padding-left": "La propiedad <code>padding-left</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> de un elemento define el espaciado que se requiere en el lado izquierdo de un elemento. El <a href=\"https://developer.mozilla.org/CSS/box_model#padding\">padding area</a> es el espacio entre el contenido del elemento y su borde. No se permite un valor negativo.",
    "padding-right": "La propiedad <code>padding-right</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> de un elemento define el espaciado que se requiere en el lado derecho de un elemento. El <a href=\"https://developer.mozilla.org/CSS/box_model#padding\">padding area</a> es el espacio entre el contenido del elemento y su borde. No se permiten valores negativos.",
    "padding-top": "La propiedad <code>padding-top</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> define el espaciado que se requiere el la parte superior de un elemento. El <a href=\"https://developer.mozilla.org/CSS/box_model#padding\">padding area</a> es el espacio entre el contenido de un elemento y su borde. Se permite un valor negativo.",
    "page-break-after": "La propiedad CSS <code>page-break-after</code> ajusta las interrupciones de la página <em>después</em> del elemento actual.",
    "page-break-before": "La propiedad <code>page-break-before</code> de CSS ajusta los saltos de página <em>antes</em> del elemento actual",
    "page-break-inside": "La propiedad <code>page-break-inside</code> de CSS ajusta los saltos de página <em>dentro</em> del elemento actual",
    "perspective": "La propiedad <code>perspective</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> determina la distancia entre el plano z=0 y el usuario para darle un poco de perspectiva al elemento posicionado en 3D. Cada elemento en 3D que se posiciona entre z=0 y el usuario se agranda, y cada elemento en 3D con z&lt;0 se achica. El valor de esta propiedad define el grado de deformación. ",
    "perspective-origin": "La propiedad <code>perspective-origin</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> determina la posición del espectador en relación al elemento que está mirando. Se utiliza como <em>punto de fuga</em> por la propiedad <code><a href=\"https://developer.mozilla.org/CSS/perspective\">perspective</a></code>.",
    "position": "La propiedad CSS <code>position</code> escoge reglas alternativas para posicionar los elementos, diseñadas para ser útiles en efectos de animación por script.",
    "quotes": "La propiedad <code>quotes</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> indica cómo los agentes de usuario deberían representar las comillas.",
    "resize": "La propiedad CSS <code>resize</code> permite controlar la modificación del tamaño de un elemento.",
    "right": "La propiedad <code>right</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> especifica una parte de la posición de los elementos posicionados.",
    "tab-size": "Ta propiedad <code>tab-size</code> de CSS se utiliza para personalizar la anchura del caractér de tabulación (<code>U+0009</code>)",
    "table-layout": "La propiedad CSS <code>table-layout</code> define qué algoritmo usar para disponer las celdas de la tabla, las filas y las columnas.",
    "text-align": "La propiedad <code>text-align</code> de CSS describe cómo el contenido alineado al igual que el texto es alineado en su elemento bloque padre. <code>text-align</code> no controla la alineación de los elementos del bloque en sí, sólo su contenido alineado.",
    "text-align-last": "La propiedad CSS <code>text-align-last</code> describe cómo se alinea la última línea de un bloque o una línea inmediatamente precedente a un salto de línea forzado. ",
    "text-decoration": "La propiedad CSS <code>text-decoration</code> se usa para definir el formato del texto <code>underline, overline, line-through</code> y <code>blink</code>.",
    "text-decoration-color": "La propiedad CSS <code>text-decoration-color</code> establece el color usado cuando se subraya, sobreraya y se tacha el texto, especificados por <code><a href=\"https://developer.mozilla.org/CSS/text-decoration-line\">text-decoration-line</a></code>. Esta es la manera preferente de colorear las decoraciones de texto, en vez de utilizar otras combinaciones de elementos HTML.",
    "text-decoration-line": "La propiedad CSS <code>text-decoration-line</code> define qué tipo de decoración de línea se añaden a un elemento.",
    "text-decoration-style": "La propiedad CSS <code>text-decoration-style</code> define el estilo de las líneas especificado por <code><a href=\"https://developer.mozilla.org/CSS/text-decoration-line\">text-decoration-line</a></code>. El estilo aplica a todas las líneas; no hay modo de definir diferentes estilos para cada línea definidos por <code>text-decoration-line</code>.",
    "text-indent": "La propiedad CSS <code>text-indent</code> especifica cuánto espacio horizontal de debería dejar antes del inicio de la primera línea del contenido del texto de un elemento. El espacio horizontal está relacionado con el límite izquierdo (o derecho en una disposición de derecha a izquierda) de la caja del bloque que contiene el elemento.",
    "text-overflow": "La propiedad <code>text-overflow</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> determina cómo el contenido desbordado que no se muestra se señala a los usuarios. Esto se puede recortar, mostrar una elipses ('<code>…</code>', <code>U+2026 HORIZONTAL ELLIPSIS</code>) o una cadena web definida por el autor.",
    "text-rendering": "La propiedad CSS <code>text-rendering</code> proveé información a la máquina de renderizado acerca de que optimizar cuando renderiza texto. El navegador hace intercambios entre velocidad, legibilidad y precisión geométrica. La propiedad text-rendering es una propiedas SVG que no está definida en ningún estándar CSS. Sin embargo, los navegadores con base en Gecko y WebKit permiten aplicar esta propiedad a contenido HTML y XML en Windows, Mack OS X y Linux. ",
    "text-shadow": "La propiedad CSS <code>text-shadow</code> añade sombras al texto. Acepta una lista de sombras separadas por commas que se aplican al texto y al <code><a href=\"https://developer.mozilla.org/CSS/text-decoration\">text-decorations</a></code> del elemento.",
    "text-transform": "La propiedad CSS <code>text-transform</code> especifica cómo poner en mayúsculas un texto del elemento. Se puede usar para que el texto aparezca todo en mayúsculas, minúsculas o cada palabra en mayúsculas.",
    "top": "La propiedad CSS <code>top</code> especifica una parte de la posición de los elementos posicionados; esta no afectará los elementos no posicionados.",
    "transform": "La propiedad CSS <code>transform</code> permite modificar el espacio de las coordenadas del modelo visual del formato. Al usarla, los elementos pueden ser traducidos, girados, ajustados y distorsionados de acuerdo con los valores definidos.",
    "transform-origin": "La propiedad CSS <code>transform-origin</code> permite modificar el origen para las transformaciones de un elemento. Por ejemplo, el transform-origin de la función <code>rotate()</code> es el centro de la rotación. (Esta propiedad se aplica primero traduciendo el elemento cerca del valor negado de la propiedad; luego, aplicando la transformación del elemento; y por último traduciendo cerca del valor de la propiedad.)",
    "transform-style": "La propiedad <code>transform-style</code> de <ahref=\"https://developer.mozilla.org/CSS\">CSS</a> determina si los hijos del elemento están posicionados en el espacio 3D o están aplanados en en el plano del elemento.",
    "transition": "La propiedad <code>transition</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> es una propiedad abreviada para <code><a href=\"https://developer.mozilla.org/CSS/transition-property\">transition-property</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/transition-duration\">transition-duration</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/transition-timing-function\">transition-timing-function</a></code> y <code><a href=\"https://developer.mozilla.org/CSS/transition-delay\">transition-delay</a></code>.",
    "transition-delay": "La propiedad <code>transition-delay</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> especifica cuánto tiempo hay que esperar entre el cambio que se requiere a una propiedad en transición y el inicio del <a href=\"https://developer.mozilla.org/CSS/CSS_transitions\">transition effect</a>.",
    "transition-duration": "La propiedad <code>transition-duration</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> especifica el número de segundos o milésimos de segundo que le toma a una animación de transición terminar. Por defecto, el valor es 0s, o sea que no habrá ninguna animación.",
    "transition-property": "La propiedad CSS <code>transition-property</code> se usa para especificar los nombres de las propiedades CSS a la cuales de debería aplicar un <a href=\"https://developer.mozilla.org/CSS/CSS_transitions\">transition effect</a>.",
    "transition-timing-function": "La propiedad CSS <code>transition-timing-function</code> es usada para describir como los valores intermedios de las propiedades CSS siendo afectadas por  <a href=\"https://developer.mozilla.org/CSS/CSS_transitions\">efectos de transición</a> son calculados. Esto, en esencia, permite establecer una curva de aceleración, permitiendo que la velocidad de la transición pueda variar durante su tiempo de ejecución.",
    "vertical-align": "La propiedad <code>vertical-align</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a> especifica la alienación vertical de un elemento alineado o tabla-celda.",
    "visibility": "La propiedad CSS <code>visibility</code> se usa para hacer dos cosas:",
    "white-space": "La propiedad CSS <code>white-space</code> se usa para describir cómo se manejan los espacios en blanco adentro del elemento.",
    "widows": "La propiedad <code>widows</code> de <a href=\"https://developer.mozilla.org/docs/CSS\" >CSS</a> define cuántas líneas mínimas deben dejarse arriba de una página nueva, en un medio <code>paged</code>. En tipografía, una <em>viuda</em> es la última línea de un párrafo que aparece sola en la parte superior de una página. Definir la propiedad <code>widows</code> impide dejar las ventanas.",
    "width": "La propiedad CSS <code>width</code> especifica el ancho del área del contenido de un elemento. El <a href=\"https://developer.mozilla.org/CSS/box_model#content\">content area</a> está <em>adentro</em> del espaciado, borde y margen del elemento.",
    "word-spacing": "La propiedad CSS <code>word-spacing</code> especifica el comportamiento del espacio entre las etiquetas y las palabras.",
    "word-wrap": "La propiedad <code>word-wrap</code> de <a href=\"https://developer.mozilla.org/CSS\">CSS</a>se utiliza para especificar si se permite o no al navegador romper el orden de las lineas en las palabras para prevenir el desbordamiento cuando una cadena irrompible es demasiado larga.",
    "z-index": "La propiedad CSS <code>z-index</code> especifica el order z de un elemento y sus descendientes. Cuando los elemento se sobreponen, el orden z determina cuál cubre el otro. El elemento que tiene un mayor índice z cubre el elemento con un índice menor.",
    "align-content": "The <code>align-content</code> CSS property aligns a flex container's lines within the flex container when there is extra space on the cross-axis.",
    "align-items": "The <code>align-items</code> CSS property aligns flex items of the current flex line the same way as justify-content but in the perpendicular direction.",
    "align-self": "The <code>align-self</code> CSS property aligns flex items of the current flex line overriding the align-items value. If any of the flex item's cross-axis margin is set to auto, then align-self is ignored.",
    "flex": "The <code>flex</code> CSS property  is a shorthand property specifying the ability of a flex item to alter its dimensions to fill available space.",
    "flex-basis": "The <code>flex-basis</code> CSS property specifies the flex basis which is the initial main size of a flex item.",
    "flex-direction": "The <code>flex-direction</code> CSS property specifies how flex items are placed in the flex container defining the main axis and the direction (normal or reversed).",
    "flex-flow": "The <code>flex-flow</code> CSS property is a shorthand property for flex-direction and flex-wrap individual properties.",
    "flex-grow": "The <code>flex-grow</code> CSS property specifies the flex grow factor of a flex item.",
    "flex-shrink": "The <code>flex-shrink</code> CSS property specifies the flex shrink factor of a flex item.",
    "flex-wrap": "The <code>flex-wrap</code> CSS property specifies whether the children are forced into a single line or if the items can be flowed on multiple lines.",
    "justify-content": "The <code>justify-content</code> CSS property defines how a browser distributes available space between and around elements when aligning flex items in the main-axis of the current line."
}