{
    "animation": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>animation</code> est un raccourci pour les propriétés <code><a href=\"https://developer.mozilla.org/CSS/animation-name\">animation-name</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/animation-duration\">animation-duration</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/animation-timing-function\">animation-timing-function</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/animation-delay\">animation-delay</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/animation-iteration-count\">animation-iteration-count</a></code> et <code><a href=\"https://developer.mozilla.org/CSS/animation-direction\">animation-direction</a></code>.",
    "animation-delay": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>animation-delay</code>  indique quand doit commencer l'animation. Ceci permet à la séquence d'animation de débuter quelques temps après qu'elle soit appliquée à un élément.",
    "animation-direction": "La propriété CSS <code>animation-direction</code> précise si l'animation doit se jouer à l'envers ou selon des cycles alternés.",
    "animation-duration": "La propriété CSS <code>animation-duration</code> précise la durée que l'animation doit utiliser pour compléter un cycle.",
    "animation-iteration-count": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>animation-iteration-count</code> définit le nombre de fois qu'un cycle d'animation doit être joué avant de s'arrêter.",
    "animation-name": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>animation-name</code> spécifie une liste d'animations qui doivent être appliquées à l'élément sélectionné. Chacun des noms indique une règle <code><a href=\"https://developer.mozilla.org/CSS/@keyframes\">@keyframes</a></code> qui définit les valeurs des propriétés pour la séquence animée.",
    "animation-play-state": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>animation-play-state</code> détermine si l'animation est en cours de lecture ou en pause. Vous pouvez interroger cette propriété afin de déterminer si l'animation est en cours de lecture ou non. De plus, vous pouvez modifier cette valeur pour mettre en pause ou reprendre la lecture de l'animation.",
    "animation-timing-function": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>animation-timing-function</code> spécifie la manière dont l'animation CSS progresse au cours de chaque cycle. Les différentes valeurs possibles sont une ou plusieurs <span><code><a href=\"https://developer.mozilla.org/CSS/timing-function\">&lt;timing-function&gt;</a></code></span>.",
    "azimuth": "En combinaison avec <code>elevation</code>, <code>azimuth</code> permet à différentes sources audio d'êtres positionnées dans l'espace pour les présentations sonores. On dispose alors d'une manière naturelle de distinguer différentes voix, puisque chacune d'elle peut être disposée de manière à provenir d'une direction différente. Une sortie stéréo donne lieu à une direction latérale uniquement, tandis que des écouteurs polyphoniques ou des ensembles de hauts-parleurs permettent une représentation réelle en trois dimensions.",
    "backface-visibility": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>backface-visibility</code> détermine si la face arrière d'un élément doit être visible ou non lorsqu'elle fait face à l'utilisateur. Lorsqu'elle est visible, la face arrière d'un élément est toujours un fond transparent et une image de la face avant est visible comme si elle était vue dans un miroir.",
    "background": "La propriété CSS <code>background</code> est un raccourci permettant de gérer les différentes valeurs d'un même arrière-plan, à un seul endroit de la feuille de style.  <code>background</code> peut être utilisé afin de définir des valeurs pour un ou plusieurs : <code><a href=\"https://developer.mozilla.org/CSS/background-color\">background-color</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/background-image\">background-image</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/background-position\">background-position</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/background-repeat\">background-repeat</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/background-size\">background-size</a></code>, and <code><a href=\"https://developer.mozilla.org/CSS/background-attachment\">background-attachment</a></code>.",
    "background-attachment": "Si la propriété <code><a href=\"https://developer.mozilla.org/CSS/background-image\">background-image</a></code>\n est définie, la propriété  <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>background-attachment</code> permet de déterminer si la position de l'image est fixe au sein de la vue ou si elle défile avec le bloc englobant.",
    "background-clip": "La propriété CSS <code>background-clip</code> spécifie si l'arrière-plan d'un élément, soit la couleur soit l'image, s'étend au-dessous de sa bordure.",
    "background-color": "La propriété< a href=\"https://developer.mozilla.org/CSS\">CSS</a><code>background-color</code> définit la couleur d'arrière-plan d'un élément, soit par une valeur de couleur soit par le mot-clé <code>transparent</code>.",
    "background-image": "La propriété CSS <code>background-image</code> définit les images de fond pour un élément. Les images sont dessinées sur des couches de contexte successives, la première spécifiée étant rendue comme étant la plus proche de l'utilisateur. Les <a href=\"https://developer.mozilla.org/CSS/border\">bordures</a> de l'élément sont tracées par dessus celles-ci, et la propriété CSS <code><a href=\"https://developer.mozilla.org/CSS/background-color\">background-color</a></code> dessinée sous celles-ci.",
    "background-origin": "La propriété CSS <code>background-origin</code> détermine la zone de placement du fond, qui correspond aussi à la position de l'origine d'une image spécifiée en utilisant la propriété CSS <code><a rel=\"custom\" href=\"https://developer.mozilla.org/CSS/background-image\">background-image</a></code>.",
    "background-position": "La propriété CSS <code>background-position</code> définit la position initiale, par rapport à la position de la couche d'arrière-plan définie par <code><a href=\"https://developer.mozilla.org/CSS/background-origin\">background-origin</a></code> pour chacune des image d'arrière-plan.",
    "background-repeat": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>background-repeat</code> définit comment les images de fond sont répétées. Une image de fond peut être répété suivant l'axe horizontal, l'axe vertical, les deux, ou pas du tout répétée. Lorsque la répétition des mosaïques d'images ne permet pas de couvrir exactement le fond, la façon dont les ajustements sont faits peut être contrôlée par l'auteur : par défaut, la dernière image est tronquée, mais les différentes tuiles peuvent au contraire être redimensionnées, ou bien de l'espace peut être inséré entre les tuiles.",
    "background-size": "La propriété CSS <code>background-size</code> précise la taille des images d'arrière-plan.",
    "bleed": "Cette propriété spécifie l'étendue du saignement de page en dehors de la boîte de page. Cette propriété n'a d'effet que si les marques de coupe sont activées.",
    "border": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>border</code> est un raccourci pour définir les valeurs des propriétés de toutes les bordures dans une seule et unique règle CSS. <code>border</code> peut être utilisée pour définir les valeurs des propriétés suivantes : <code><a href=\"https://developer.mozilla.org/CSS/border-width\">border-width</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/border-style\">border-style</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/border-color\">border-color</a></code>.",
    "border-bottom": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>border-bottom</code> est un raccourci qui permet de définir les valeurs de <code><a href=\"https://developer.mozilla.org/CSS/border-bottom-color\">border-top-color</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/border-bottom-style\">border-bottom-style</a></code> et <code><a href=\"https://developer.mozilla.org/CSS/border-bottom-width\">border-bottom-width</a></code>. Ces propriétés définissent les bordures inférieures des éléments.",
    "border-bottom-color": "La propriété CSS <code>border-bottom-color</code> définit la couleur de la bordure inférieure d'un élément. Il est à noter que les raccourcis <code><a href=\"https://developer.mozilla.org/CSS/border-color\">border-color</a></code> ou <code><a href=\"https://developer.mozilla.org/CSS/border-bottom\">border-bottom</a></code> sont dans bien des cas mieux adaptés et préférables.",
    "border-bottom-left-radius": "La propriété CSS <code>border-bottom-left-radius</code> définit l'arrondi de la bordure du coin en bas à gauche de l'élément. L'arrondi peut être un cercle ou une ellipse, ou si l'une des valeurs est <code>0</code> aucun arrondi n'est fait et le coin est un angle droit.",
    "border-bottom-right-radius": "La propriété CSS <code>border-bottom-right-radius</code> définit l'arrondi de la bordure du coin en bas à droite de l'élément. L'arrondi peut être un cercle ou une ellipse, ou si l'une des valeurs est <code>0</code> aucun arrondi n'est fait et le coin est un angle droit.",
    "border-bottom-style": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>border-bottom-style</code> définit le style de ligne de la bordure inférieure d'une boîte.",
    "border-bottom-width": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>border-bottom-width</code> définit la largeur de la bordure inférieure d'une boîte.",
    "border-collapse": "La propriété CSS <code>border-collapse</code> est utilisée pour fusionner les bordures. Elle a une grande influence sur l'affichage et le style des cellules de tableau.",
    "border-color": "La propriété CSS <code>border-color</code> est un raccourci pour définir la couleur des quatre côtés de la bordure d'un élément :  <code><a href=\"https://developer.mozilla.org/CSS/border-top-color\">border-top-color</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/border-right-color\">border-right-color</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/border-bottom-color\">border-bottom-color</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/border-left-color\">border-left-color</a></code>",
    "border-image": "La propriété CSS <code>border-image</code> permet de déclarer une image sur les bords d'un élément. Cette propriété permet d'élaborer des widgets complexes de manière beaucoup plus simple, en supprimant le fait de devoir déclarer neuf boîtes dans certains cas.",
    "border-image-outset": "La propriété <code>border-image-outset</code> décrit la <dfn>zone de bordure d'image</dfn> qui se prolonge au delà de la bordure de la boite.",
    "border-image-repeat": "La propriété CSS <code>border-image-repeat</code> définit comment la partie centrale d'une image de frontière est gérée en fonction de la taille de la bordure. Elle a une syntaxe d'une valeur qui décrit le comportement de tous les côtés, et une syntaxe deux-valeurs qui définit une valeur différente pour le comportement horizontal et vertical.",
    "border-image-source": "La propriété CSS <code>border-image-source</code> définit le type de donnée CSS <code><a href=\"https://developer.mozilla.org/CSS/image\">&lt;image&gt;</a></code> à utiliser à la place du style de la bordure. Si cette propriété est définie par <code>none</code>, c'est le style défini par <code><a href=\"https://developer.mozilla.org/CSS/border-style\">border-style</a></code> qui sera utilisé.",
    "border-image-width": "La propriété CSS <code>border-image-width</code> définit la marge à utiliser pour diviser la bordure d'une image en neuf parties, le coin gauche-haut, le bord du haut, le coin droite-haut, le bord de droite, le coin droite-bas, le bord du bas, le coin gauche-bas et le bord de gauche. Ils représentent la distance intérieure des bords haut, droite, bas et gauche.",
    "border-left": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>border-left</code> est un raccourci pour les propriétés <code><a href=\"https://developer.mozilla.org/CSS/border-left-color\">border-left-color</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/border-left-style\">border-left-style</a></code> et <code><a href=\"https://developer.mozilla.org/CSS/border-left-width\">border-left-width</a></code>. Ces propriétés définissent la bordure de gauche d'un élément.",
    "border-left-color": "La propriété CSS <code>border-left-color</code> définit la couleur de la bordure à gauche d'un élément. Il est à noter que les raccourcis <code><a href=\"https://developer.mozilla.org/CSS/border-color\">border-color</a></code> ou <code><a href=\"https://developer.mozilla.org/CSS/border-left\">border-left</a></code> sont dans bien des cas mieux adaptés et préférables.",
    "border-left-style": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>border-left-style</code> définit le style de ligne de la bordure gauche d'une boîte.",
    "border-left-width": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>border-left-width</code> définit la largeur de la bordure gauche d'une boîte.",
    "border-radius": "La propriété <code>border-radius</code> permet de définir comment les coins des bordures sont arrondis. La courbe de chaque coin est définie en utilisant un ou deux rayons, définissant sa forme : cercle ou ellipse.",
    "border-right": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>border-right</code> est un raccourci pour les propriétés <code><a href=\"https://developer.mozilla.org/CSS/border-right-color\">border-right-color</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/border-right-style\">border-right-style</a></code> et <code><a href=\"https://developer.mozilla.org/CSS/border-right-width\">border-right-width</a></code>. Ces propriétés définissent la bordure de droite d'un élément.",
    "border-right-color": "La propriété CSS <code>border-right-color</code> définit la couleur de la bordure à droite d'un élément. Il est à noter que les raccourcis <code><a href=\"https://developer.mozilla.org/CSS/border-color\">border-color</a></code> ou <code><a href=\"https://developer.mozilla.org/CSS/border-right\">border-right</a></code> sont dans bien des cas mieux adaptés et préférables.",
    "border-right-style": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>border-right-style</code> définit le style de ligne de la bordure droite d'une boîte.",
    "border-right-width": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>border-right-width</code> définit la largeur de la bordure droite d'une boîte.",
    "border-spacing": "La propriété CSS <code>border-spacing</code> spécifie la distance entre les bords de cellules adjacentes (uniquement pour le modèle de bordures séparées <a href=\"https://developer.mozilla.org/CSS/border-collapse\">separated borders model</a>). Cette propriété est équivalente à l'attribut de présentation <code>cellspacing</code> en HTML, mais une seconde valeur optionnelle peut être utilisée pour définir un espacement horizontal différent de l'espacement vertical.",
    "border-style": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>border-style</code> est un raccourci pour définir le style de ligne des quatre côtés de la bordure d'un élément.",
    "border-top": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>border-top</code> est un raccourci qui permet de définir les valeurs de <code><a href=\"https://developer.mozilla.org/CSS/border-top-color\">border-top-color</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/border-top-style\">border-top-style</a></code> et <code><a href=\"https://developer.mozilla.org/CSS/border-top-width\">border-top-width</a></code>. Ces propriétés définissent les bordures supérieures des éléments.",
    "border-top-color": "La propriété CSS <code>border-top-color</code> définit la couleur de la bordure supérieure d'un élément. Il est à noter que les raccourcis <code><a href=\"https://developer.mozilla.org/CSS/border-color\">border-color</a></code> ou <code><a href=\"https://developer.mozilla.org/CSS/border-top\">border-top</a></code> sont dans bien des cas mieux adaptés et préférables.",
    "border-top-left-radius": "La propriété CSS <code>border-top-left-radius</code> définit l'arrondi de la bordure du coin en haut à gauche de l'élément. L'arrondi peut être un cercle ou une ellipse, ou si l'une des valeurs est <code>0</code> aucun arrondi n'est fait et le coin est un angle droit.",
    "border-top-right-radius": "La propriété CSS <code>border-top-right-radius</code> définit l'arrondi de la bordure du coin en haut à droite de l'élément. L'arrondi peut être un cercle ou une ellipse , ou si l'une des valeurs est <code>0</code> aucun arrondi n'est fait et le coin est un angle droit.",
    "border-top-style": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>border-top-style</code> définit le style de ligne de la bordure supérieure d'une boîte.",
    "border-top-width": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>border-top-width</code> définit la largeur de la bordure supérieure d'une boîte.",
    "border-width": "La propriété CSS <code>border-width</code> définit la largeur de la bordure d'une boîte.  L'utilisation du raccourci <code><a href=\"https://developer.mozilla.org/CSS/border\">border</a></code> est souvent plus pratique.",
    "bottom": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>bottom</code> participe à la définition de la position d'un <em>élément positionné</em>.",
    "box-shadow": "La propriété CSS <code>box-shadow</code> accepte un ou plusieurs effets d'ombre définis sous la forme d'une liste séparée par des virgules. Elle permet de projeter l'ombre de presque n'importe quel élément. Si une bordure arrondie est définie à l'aide de <code><a href=\"https://developer.mozilla.org/CSS/border-radius\">border-radius</a></code> sur l'élément auquel s'applique l'ombre, l'ombre ainsi créée aura les mêmes bords arrondis. Le niveau sur l'axe z d'ombres multiples est le même que <a href=\"https://developer.mozilla.org/CSS/text-shadow\">text shadows</a> multiples (la première ombre spécifiée est sur le dessus).",
    "box-sizing": "La propriété CSS <code>box-sizing</code> sert à modifier le modèle de boîte CSS par défaut qui est utilisé pour calculer la largeur et la hauteur des éléments. Il est possible d'utiliser cette propriété pour émuler le comportement des navigateurs qui n'appliquent pas correctement la spécification du modèle de boîte CSS.",
    "caption-side": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>caption-side</code> positionne le contenu de l'élément <code><a href=\"https://developer.mozilla.org/HTML/Element/caption\">&lt;caption&gt;</a></code> d'un tableau du côté spécifié.",
    "clear": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>clear</code> définit si un élément peut être proche d'éléments <a href=\"https://developer.mozilla.org/CSS/float\">flottants</a> qui le précèdent ou s'il doit être placé en dessous.",
    "clip": "La propriété CSS <code>clip</code> définit quelle portion d'un élément est visible. La propriété <code>clip</code> s'applique uniquement aux éléments avec <code><a href=\"https://developer.mozilla.org/CSS/position\">position:absolute</a></code>.",
    "color": "La propriété CSS <code>color</code> définit la couleur du contenu de texte d'un élément.",
    "column-count": "La propriété CSS <code>column-count</code> détermine le nombre de colonnes d'un élément.",
    "column-fill": "La propriété CSS <code>column-fill</code> contrôle la façon dont le contenu est réparti au sein des colonnes. Cela peut être réparti de façon à ce que le contenu de toute les colonnes ait la même hauteur ou, lorsqu'on utilise <code>auto</code>, que seul l'espace nécessaire soit utilisé.",
    "column-gap": "La propriété CSS <code>column-gap</code> définit la taille d'espacement entre les colonnes pour les éléments qui ont un affichage sur plusieurs colonnes",
    "column-rule": "Dans les mises en page multi-colonnes, la propriété CSS <code>column-rule</code> précise une qu'une ligne droite, ou « règle »,  doit être tracée pour séparer les colonnes. C'est un moyen pratique qui évite de paramétrer chaque propriété individuelle <code>column-rule-*</code> séparément : <code><a href=\"https://developer.mozilla.org/CSS/column-rule-width\">column-rule-width</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/column-rule-style\">column-rule-style</a></code> and <code><a href=\"https://developer.mozilla.org/CSS/column-rule-color\">column-rule-color</a></code>.",
    "column-rule-color": "La propriété CSS <code>column-rule-color</code> permet de définir la couleur de la lige dessinée entre les colonnes dans une mise en page multi-colonne.",
    "column-rule-style": "La propriété CSS <code>column-rule-style</code> permet de définir le style de la ligne tracée entre les colonnes d'une mise en page multi-colonne.",
    "column-rule-width": "La propriété <code>column-rule-width</code> permet de définir la largeur de la ligne tracée entre les colonnes d'une mise en page multi-colonne.",
    "column-span": "La propriété CSS <code>column-span</code> permet à un élément de s'étendre sur toutes les colonnes lorsqu'elle vaut <code>all</code>. Un élément qui s'étend sur plus d'une colonne est appelé un <strong>élément de chevauchement (<em>spanning element</em> en anglais)</strong>.",
    "column-width": "La propriété CSS <code>column-width</code> suggère une largeur optimale de colonne. Ce n'est pas une valeur absolue mais plutôt une indication. Le navigateur ajustera la largeur des colonnes autour de la valeur suggérée, permettant ainsi des mises en pages s'adaptant à différentes tailles d'écran. Plus particulièrement en conjonction avec la propriété CSS <code><a href=\"https://developer.mozilla.org/CSS/column-count\">column-count</a></code> qui a l'ascendant, pour déterminer une largeur exacte de colonne, toutes les valeurs de longueurs doivent être spécifiées. Pour du texte horizontal, cela inclue donc <code><a href=\"https://developer.mozilla.org/CSS/width\">width</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/column-width\">column-width</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/column-gap\">column-gap</a></code> et <code><a href=\"https://developer.mozilla.org/CSS/column-rule-width\">column-rule-width</a></code>.",
    "columns": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>columns</code> est un raccourci permettant de définir en même temps les deux propriétés <code><a href=\"https://developer.mozilla.org/CSS/column-width\">column-width</a></code> et <code><a href=\"https://developer.mozilla.org/CSS/column-count\">column-count</a></code>.",
    "content": "La propriété CSS <code>content</code> est utilisée avec les pseudo-éléments <code><a href=\"https://developer.mozilla.org/CSS/%3Abefore\">:before</a></code> et <code><a href=\"https://developer.mozilla.org/CSS/%3Aafter\">:after</a></code> pour générer du contenu dans un élément.",
    "counter-increment": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>counter-increment</code> est utilisée pour incrémenter la valeur des <a href=\"https://developer.mozilla.org/CSS_Counters\">compteurs CSS</a> d'une valeur donnée. Les compteurs de cette valeur peuvent être réinitialisés en utilisant la propriété CSS <code><a href=\"https://developer.mozilla.org/CSS/counter-reset\">counter-reset</code></a>.",
    "counter-reset": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>counter-reset</code> est utilisée pour réinitialiser les <a href=\"https://developer.mozilla.org/CSS_Counters\">compteurs CSS</a> d'une valeur donnée.",
    "cursor": "La propriété CSS <code>cursor</code> définit le pointeur affiché lorsque le curseur de la souris survole un élément.",
    "direction": "La propriété CSS <code>direction</ code> doit être réglée pour correspondre à la direction du texte : <code>rtl</ code> pour l'hébreu ou l'arabe du texte et <code>ltr</ code> pour d'autres types d'écriture. Cela devrait normalement être effectué dans le cadre du document (par exemple, en utilisant l'attribut <code>dir</ code> en HTML) plutôt que par l'utilisation directe de CSS.",
    "display": "La propriété CSS <code>display</code> définit le type de rendu utilisé pour un élément. En HTML, les valeurs par défaut de la propriété <code>display</code> proviennent des spécifications HTML ou des feuilles de style par défaut du navigateur et/ou de l'utilisateur. En XML la valeur par défaut est <code>inline</code>.",
    "empty-cells": "La propriété CSS <code>empty-cells</code> définit comment l'user-agent doit afficher les bordures et les arrière-plans autour des cellules qui ont un contenu non visible.",
    "float": "La propriété CSS <code>float</code> spécifie qu'un élément devrait être retiré du flux normal et placé sur le côté droit ou gauche de son conteneur, dont le texte et les éléments en-ligne couleront autour de lui.",
    "font": "La propriété CSS <code>font</code> est soit un raccourci pour définir les propriétés <code><a href=\"https://developer.mozilla.org/CSS/font-style\">font-style</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/font-variant\">font-variant</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/font-weight\">font-weight</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/font-size\">font-size</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/line-height\">line-height</a></code> et <code><a href=\"https://developer.mozilla.org/CSS/font-family\">font-family</a></code>, soit une manière d'utiliser une police système pour l'élément, à l'aide de mots-clés spécifiques.",
    "font-family": "La propriété CSS <code>font-family</code> permet de faire une liste hiérarchisée de noms de familles de polices et de noms de famille génériques devant être spécifiés pour l'élément sélectionné. Contrairement à la plupart des autres propriétés CSS, les valeurs sont séparées par une virgule pour indiquer qu'elles sont des alternatives. Le navigateur permet de sélectionner la première police de la liste qui est installée sur l'ordinateur, ou qui peut être téléchargée à l'aide des informations fournies par une règle <code><a href=\"https://developer.mozilla.org/CSS/@font-face\">@font-face</a></code>.",
    "font-size": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>font-size</code> indique la taille de la police. Celle-ci peut à son tour modifier la taille d'autres éléments, car elle est utilisée pour calculer la valeurs des unités de longueur <code>em</code> et <code>ex</code>.",
    "font-size-adjust": "La propriété CSS <code>font-size-adjust</code> indique si la taille de la police doit être choisie en fonction de la hauteur des lettres bas de casse ou de celle des lettres capitales.",
    "font-stretch": "La propriété CSS <code>font-stretch</code> sélectionne un aspect normal, condensé ou étendu d'une famille de police.",
    "font-style": "La propriété CSS <code>font-style</code> permet d'utiliser des variantes en italique (<code>italic</code>) ou obliques (<code>oblique</code>) au sein d'une <code><a href=\"https://developer.mozilla.org/CSS/font-family\">famille de polices</a></code>.<br>",
    "font-variant": "La propriété CSS <code>font-variant</code> permet de choisir entre les variantes <code>normal</code>, ou <code>small-caps</code> pour la famille de polices. Choisir <code>font-variant</code> est également possible en utilisant le raccourci <code><a href=\"https://developer.mozilla.org/CSS/font\">font</a></code>.",
    "font-weight": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code><a href=\"https://developer.mozilla.org/CSS/font-weight\">font-weight</a></code> définit l'épaisseur ou la graisse de la police. Cependant, toutes les polices ne sont pas disponibles avec toutes les épaisseurs. Certaines ne sont disponibles qu'en <code>normal</code> et <code>bold</code>.",
    "height": "La propriété CSS <code>height</code> indique la hauteur de la zone de contenu d'un élément. La <a href=\"https://developer.mozilla.org/CSS/box_model#content\">zone de contenu</a> est <em>à l'intérieur</em> des remplissages, bordures et marges de l'élément.",
    "hyphens": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>hyphens</code> communique au navigateur la méthode à utiliser pour faire la césure des mots afin d'améliorer l'agencement du texte.",
    "image-rendering": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>image-rendering</code> agit comme un indice pour l'user-agent afin de savoir comment il doit procéder pour le rendu des images.<br><code>image-rendering</code> s'applique aux images redimensionnées (et à d'autres éléments, voir plus bas). Par exemple, si la taille naturelle d'une image est <em>100×100px</em> mais que l'auteur de la page spécifie ces dimensions comme <code>200×200px</code> (ou <code>50×50px</code>), alors l'image devra être agrandie (ou réduite) aux nouvelles dimensions en utilisant l'algorithme spécifié. La mise à l'échelle peut aussi être appliquée suite à une interaction avec l'utilisateur (effet de zoom).",
    "left": "La propriété CSS <code>left</code> précise une partie de la position des éléments positionnés.",
    "letter-spacing": "La propriété CSS <code>letter-spacing</code> précise le type d'espacement entre les caractères de texte.",
    "line-height": "Pour les éléments en ligne, la propriété CSS <code>line-height</code> définit la hauteur utilisée lors du calcul de la hauteur de la ligne.<br>\nPour les éléments en bloc,<code>line-height</code> spécifie la hauteur minimale des lignes au sein des blocs de l'élément.",
    "list-style": "La propriété CSS <code>list-style</code> est un raccourci pour définir simultanément les paramètres <code><a href=\"https://developer.mozilla.org/CSS/list-style-type\">list-style-type</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/list-style-image\">list-style-image</a></code> et <code><a href=\"https://developer.mozilla.org/CSS/list-style-position\">list-style-position</a></code>.",
    "list-style-image": "La propriété CSS <code>list-style-image</code> permet de définir l'image utilisée pour la puce d'une liste. Le raccourci <code><a href=\"https://developer.mozilla.org/CSS/list-style\">list-style</a></code> est souvent plus pratique.",
    "list-style-position": "La propriété CSS <code>list-style-position</code> définit la position de la puce par rapport à la boîte principale. Le raccourci <span><code><a href=\"https://developer.mozilla.org/CSS/list-style\">list-style</a></code></span> est souvent plus pratique.",
    "list-style-type": "La propriété CSS <code> list-style-type </code> définit l'apparence d'un élément d'une liste. Cette propriété étant utilisée par <code>display:list-item</code>, cela sera souvent un élément <code><a  href=\"https://developer.mozilla.org/HTML/Element/li\">&lt;li&gt;</a></code>, bien que ça puisse être n'importe quel élément avec cette valeur <code><a href=\"https://developer.mozilla.org/CSS/display\">display</a></code>.",
    "margin": "La propriété CSS <code>margin</code> définit la marge pour les quatre côtés. C'est un raccourci pour éviter de régler chaque côté séparément avec les autres propriétés de marge (<br><code><a href=\"https://developer.mozilla.org/CSS/margin-top\">margin-top</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/margin-right\">margin-right</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/margin-bottom\">margin-bottom</a></code> et <code><a href=\"https://developer.mozilla.org/CSS/margin-left\">margin-left</a></code>).<br>Il est également possible d'utiliser des valeurs négatives.",
    "margin-bottom": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>margin-bottom</code> d'un élément définit l'espace de marge nécessaire en bas de celui-ci. Il est également possible d'utiliser une valeur négative.",
    "margin-left": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>margin-left</code> d'un élément définit l'espace de marge nécessaire à gauche de celui-ci. Il est également possible d'utiliser une valeur négative.",
    "margin-right": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>margin-right</code> d'un élément définit l'espace de marge nécessaire à droite de celui-ci. Il est également possible d'utiliser une valeur négative.",
    "margin-top": "La propriété CSS <code>margin-top</code> d'un élément définit l'espace de marge nécessaire en haut de celui-ci. Il est également possible d'utiliser une valeur négative.",
    "marker-offset": "La propriété <code>marker-offset</code> définit la distance entre les coins les plus proches d'un marqueur et sa boite associée.",
    "marks": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <a href=\"https://developer.mozilla.org/CSS\">CSS</a> ajoute des marques de découpe et/ou des croix à la présentation du document. Les <em>marques de découpes</em> indiquent où la page doit être coupée. Les <em>croix</em> doivent être utilisées pour aligner les pages.",
    "max-height": "La propriété CSS <code>max-height</code> est utilisée pour définir une hauteur maximale pour un élément donné. Elle empêche la valeur de la propriété <code><a href=\"https://developer.mozilla.org/CSS/height\">height</a></code> de devenir supérieure à la valeur de <code>max-height</code>.",
    "max-width": "La propriété CSS <code>max-width</code> est utilisée pour définir la largeur maximale d'un élément donné. Elle empêche la valeur utilisée de la propriété <code><a href=\"https://developer.mozilla.org/CSS/width\">width</a></code> d'être plus grande que la valeur précisée par <code>max-width</code>.",
    "min-height": "La propriété CSS <code>min-height</code> est utilisée pour fixer la hauteur minimale d'un élément. Elle empêche la hauteur de l'élément précisée par sa propriété <code><a href=\"https://developer.mozilla.org/CSS/height\">height</a></code> de devenir inférieure à la valeur de <code>min-height</code>.",
    "min-width": "La propriété CSS <code>min-width</code> est utilisée pour définir la largeur minimale d'un élément donné. Elle empêche la valeur utilisée de la propriété <code><a href=\"https://developer.mozilla.org/CSS/width\">width</a></code>\nd'être plus petite que la valeur précisée par <code>min-width</code>.",
    "opacity": "La propriété CSS <code>opacity</code> spécifie la transparence d'un élément, c'est à dire la proportion dans laquelle l'arrière-plan de l'élément reste visible.",
    "orphans": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>orphans</code> déclare le nombre <em>minimum</em> de lignes dans un bloc qui doivent rester au bas de la page. Cette propriété est utilisée pour contrôler les sauts de page.",
    "outline": "La propriété CSS <code>outline</code> est un raccourci pour définir une ou plusieurs des propriétés <code><a href=\"https://developer.mozilla.org/CSS/outline-style\">outline-style</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/outline-width\">outline-width</a></code> et <code><a href=\"https://developer.mozilla.org/CSS/outline-color\">outline-color</a></code> dans une seule règle. Dans la plupart des cas, l'usage de ce raccourci est préférable et plus pratique.",
    "outline-color": "La propriété CSS <code>outline-color</code> est utilisée pour définir la couleur de l'encadrement d'un élément. Cet encadrement est une ligne dessinée autour d'un élément au-delà de sa bordure, pour le mettre en avant.",
    "outline-offset": "La propriété CSS <code>outline-offset</code> est utilisé pour espacer un <code><a href=\"https://developer.mozilla.org/CSS/outline\">outline</a></code> et le bord d'un élément. Un contour est une ligne, dessinée autour des éléments, à l'extérieur de la bordure.",
    "outline-style": "La propriété CSS <code>outline-style</code> est utilisée pour définie le style du contour d'un élément. Un contour est une ligne dessinée autour des éléments, à l'extérieur de la bordure pour faire ressortir cet élément.",
    "outline-width": "La propriété CSS <code>outline-width</code> est utilisée pour définir l'épaisseur de l'encadrement d'un élément. Cet encadrement est une ligne dessinée autour d'un élément au-delà de sa bordure, pour le mettre en avant.",
    "overflow": "La propriété CSS <code>overflow</code> définit comment le contenu est rogné, les barres de défilement sont affichées ou l'affichage du contenu en débord dans un élément bloc.",
    "overflow-x": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>overflow-x</code> définit comment rogner le contenu dans le sens horizontal, afficher les barres de défilement ou afficher le contenu en débord dans un élément bloc sur ses cotés droit et gauche.",
    "padding": "La propriété CSS <code>padding</code> définit l'espace de marge intérieure nécessaire tout autour d'un élément. La <a href=\"https://developer.mozilla.org/CSS/Box_model#padding\">padding area</a> est l'espace entre le contenu de l'élément et sa bordure. Il n'est pas possible d'utiliser une valeur négative.",
    "padding-bottom": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>padding-bottom</code> d'un élément définit l'espace de marge intérieure nécessaire en bas de celui-ci. La <a href=\"https://developer.mozilla.org/CSS/box_model#padding\">padding area</a> est l'espace entre le contenu de l'élément et sa bordure. Il n'est pas possible d'utiliser une valeur négative.",
    "padding-left": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>padding-left</code> d'un élément définit l'espace de marge intérieure nécessaire à gauche de celui-ci. La <a href=\"https://developer.mozilla.org/CSS/box_model#padding\">padding area</a> est l'espace entre le contenu de l'élément et sa bordure. Il n'est pas possible d'utiliser une valeur négative.",
    "padding-right": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>padding-right</code> d'un élément définit l'espace de marge intérieure nécessaire à droite de celui-ci. La <a href=\"https://developer.mozilla.org/CSS/box_model#padding\">padding area</a> est l'espace entre le contenu de l'élément et sa bordure. Il n'est pas possible d'utiliser une valeur négative.",
    "padding-top": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>padding-top</code> d'un élément définit l'espace de marge intérieure nécessaire en haut de celui-ci. La <a href=\"https://developer.mozilla.org/CSS/box_model#padding\">padding area</a> est l'espace entre le contenu de l'élément et sa bordure. Il n'est pas possible d'utiliser une valeur négative.",
    "page-break-after": "La propriété CSS <code>page-break-after</code> permet d'ajuster les sauts de page <em>après</em> l'élément courant.",
    "page-break-before": "La propriété CSS <code>page-break-before</code> permet d'ajuster les sauts de page <em>avant</em> l'élément courant.",
    "page-break-inside": "La propriété CSS <code>page-break-inside</code> permet d'ajuster les sauts de page <em>à l'intérieur</em> de l'élément courant.",
    "perspective": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>perspective</code> détermine la distance entre le plan z=0 et l'utilisateur dans le but de donner du relief à un élément positionné en trois dimensions. Chaque élément en trois dimensions qui est situé entre le plan z=0 et l'utilisateur est agrandi , tandis que ceux situés dans le domaine z<0 sont réduits. L'amplitude de la déformation est définie par cette propriété.",
    "perspective-origin": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a><code>perspective-origin</code> détermine la position que le spectateur vise. Elle est utilisée comme <em>point de fuite</em> par la propriété <code><a href=\"https://developer.mozilla.org/CSS/perspective\">perspective</a></code>.",
    "position": "La propriété CSS <code>position</code> choisit des règles alternatives pour le positionnement des éléments, elle est conçue pour être utile aux effets d'animation par script.",
    "quotes": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>quotes</code> indique comment les navigateurs doivent afficher les guillemets de citation.",
    "resize": "La propriété CSS <code>resize</code> permet de maîtriser le redimensionnement d'un élément.",
    "right": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>right</code> précise une partie de la position des éléments positionnés.",
    "tab-size": "La propriété CSS <code>tab-size</code> est utilisée pour personnaliser la largeur d'un tableau (<code>U+0009</code>) de caractères.",
    "table-layout": "La propriété CSS <code>table-layout</code> définit l'algorithme utilisé pour disposer les cellules, colonnes et lignes d'un tableau.",
    "text-align": "La propriété CSS <code>text-align</code> décrit comment le contenu intégré comme du texte est aligné dans son élément bloc parent. <code>text-align</code> ne peut contrôler l'alignement des éléments de bloc lui-même, seulement leur contenu intégré.",
    "text-align-last": "La propriété CSS <code>text-align-last</code> décrit la façon dont la dernière ligne d'un bloc ou bien une ligne juste avant le saut de ligne forcé doit être alignée.",
    "text-decoration": "La propriété CSS <code>text-decoration</code> est utilisée pour le formatage du texte : <code>underline, overline, line-through</code> et <code>blink</code>.",
    "text-decoration-color": "La propriété CSS <code>text-decoration-color</code> définit la couleur utilisée lors du traçage des soulignement, surlignement et des textes barrés définis par <code><a href=\"https://developer.mozilla.org/CSS/text-decoration-line\">text-decoration-line</a></code>. Ceci est la méthode préférée pour colorer ces décorations, plutôt qu'une combinaison d'autres éléments HTML.",
    "text-decoration-line": "La propriété CSS <code>text-decoration-line</code> détermine quelle sorte de lignes décoratives sont ajoutées à un élément.",
    "text-decoration-style": "La propriété CSS <code>text-decoration-style</code> définit le style des lignes spécifiées par <code><a href=\"https://developer.mozilla.org/CSS/text-decoration-line\">text-decoration-line</a></code>. Le style s'applique à toutes les lignes, il n'existe pas de moyen de décorer différemment chaque ligne où <code>text-decoration-line</code> s'applique.",
    "text-indent": "La propriété CSS <code>text-indent</code> définit l'espace horizontal à laisser avant d'afficher le début de la première ligne de texte d'un élément. L'espace est mesuré à partir de la gauche (ou de la droite pour les configurations de droite à gauche) du bloc contenant l'élément.",
    "text-overflow": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>text-overflow</code> détermine la façon dont le contenu qui déborde (et n'est pas affiché) sera signalé aux utilisateurs. Il pourra être tronqué, marqué d'une ellipse ('<code>…</code>', <code>U+2026 HORIZONTAL ELLIPSIS</code>) ou remplacé par une chaîne de caractères choisie.",
    "text-rendering": "La propriété CSS <code>text-rendering</code> fournit des informations au moteur de rendu afin d'optimiser le rendu du texte. C'est le navigateur qui choisit un compromis entre la vitesse, la lisibilité et la précision géométrique. Cette propriété est une propriété SVG qui n'est pas définie au sein des standards CSS. Cependant les navigateurs utilisant Gecko et WebKit permettent d'utiliser cette propriété pour du contenu XML ou HTML, sur Windows, Mac OS X et Linux.",
    "text-shadow": "La propriété CSS <code>text-shadow</code> permet d'ajouter une ombre au texte. Cet attribut accepte une liste de valeurs, séparées par des virgules, à appliquer au texte et aux <code><a href=\"https://developer.mozilla.org/CSS/text-decoration\">text-decorations</a></code> de l'élément.",
    "text-transform": "La propriété CSS <code>text-transform</code> définit la façon dont le texte d'un élément est mis en majuscules. Il peut être utilisé pour que le texte soit : tout en majuscules, tout en minuscules, ou que chaque mot commence par une majuscule.",
    "top": "La propriété CSS <code>top</code> définit une partie de la position des éléments positionnés. Elle n'a aucun effet sur les éléments qui ne sont pas positionnés.",
    "transform": "La propriété CSS <code>transform</code> permet de modifier les coordonnées spatiales du modèle de formatage visuel de CSS. En l'utilisant, les éléments pourront subir des translations, rotations, homothéties ou être inclinées selon les valeurs définies.",
    "transform-origin": "La propriété CSS <code>transform-origin</code> permet de modifier l'origine pour les transformations d'un élément. Par exemple, l'origine de transformation de la fonction <code>rotate()</code> est le centre de rotation. (Cette propriété est appliquée en faisant translater l'élément de l'opposé de la valeur spécifiée, puis en appliquant la transformation et en translatant de la valeur spécifiée.)",
    "transform-style": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>transform-style</code> détermine si un enfant d'un élément est positionné dans un espace en 3 dimensions ou est aplati dans le plan de l'élément.",
    "transition": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>transition</code> est une propriété raccourcie pour <code><a href=\"https://developer.mozilla.org/CSS/transition-property\">transition-property</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/transition-duration\">transition-duration</a></code>, <code><a href=\"https://developer.mozilla.org/CSS/transition-timing-function\">transition-timing-function</a></code>, et <code><a href=\"https://developer.mozilla.org/CSS/transition-delay\">transition-delay</a></code>.",
    "transition-delay": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>transition-delay</code> spécifie la quantité de temps à attendre entre un changement demandé sur une propriété qui doit subir une transition et le début de l'<a href=\"https://developer.mozilla.org/CSS/CSS_transitions\">effet de transition</a>.",
    "transition-duration": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>transition-duration</code> spécifie le nombre de secondes ou millisecondes durant lequel une animation de transition doit avoir lieu. Par défaut, la valeur est 0s (zéro secondes), ce qui signifie qu'aucune animation n'a lieu.",
    "transition-property": "La propriété CSS <code>transition-property</code> est utilisée pour définir le nom de propriétés CSS sur lesquelles un <a href=\"https://developer.mozilla.org/CSS/CSS_transitions\">effet de transition</a> doit être appliqué.",
    "transition-timing-function": "La propriété CSS <code>transition-timing-function</code> est utilisée pour décrire comment les valeurs intermédiaires des propriétés CSS affectées par un <a href=\"https://developer.mozilla.org/CSS/CSS_transitions\">effet de transition</a> sont calculées. Ceci permet donc de définir une courbe d’accélération, de manière à ce que la vitesse de la transition varie au cours de sa durée.",
    "vertical-align": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>vertical-align</code> définit l'alignement vertical d'un élément en ligne ou d'une cellule de tableau.",
    "visibility": "La propriété CSS <code>visibility</code> est utilisée pour deux choses :",
    "white-space": "La propriété CSS <code>white-space</code> est utilisée pour décrire la façon dont les espaces sont gérés à l'intérieur de l'élément.",
    "widows": "La propriété <a href=\"https://developer.mozilla.org/docs/CSS\" >CSS</a> <code>widows</code> définit le nombre de lignes minimal qui doivent être laissées en haut d'une nouvelle page, dans un contexte de média <code>paged</code>. En typographie, une veuve <em>widows</em> est la dernière ligne d'un paragraphe apparaissant en haut d'une page. En définissant la propriété <code>widows</code> il est possible d'éviter l'apparition de ce phénomène.",
    "width": "La propriété CSS<code>width</code> indique la largeur de la zone d'affichage d'un élément. La <a href=\"https://developer.mozilla.org/CSS/box_model#content\">zone d'affichage</a> se situe <em>à l'intérieur</em> des remplissage, bordure et marge de l'élément.",
    "word-spacing": "La propriété CSS <code>word-spacing</code> précise le type d'espacement entre les éléments et les mots.",
    "word-wrap": "La propriété <a href=\"https://developer.mozilla.org/CSS\">CSS</a> <code>word-wrap</ code> est utilisée pour spécifier si oui ou non le navigateur est autorisé à passer à la ligne au milieu des mots, de façon à éviter tout débordement lorsqu'une chaîne en principe insécable est trop longue pour tenir sur une ligne.",
    "z-index": "La propriété CSS <code> z-index </code> spécifie l'ordre de profondeur d'un élément et de ses descendants. Lorsqu'un élément recouvre un autre, c'est cet ordre qui est utilisé pour déterminer lequel apparaît en premier plan. Habituellement, plus l'indice est élevé, plus l'élément est au premier-plan par rapport aux autres.",
    "align-content": "La propriété CSS <code>align-content</code> aligne les lignes d'un conteneur flexible au sein de celui-ci lorsqu'il reste de l'espace sur l'axe perpendiculaire.",
    "align-items": "La propriété CSS <code>align-items</code> aligne les éléments de la ligne flexible courante de la même manière que justify-content, mais dans la direction perpendiculaire.",
    "align-self": "La propriété CSS <code>align-self</code> aligne les éléments de la ligne flexible courante en écrasant la valeur de align-items. Si au moins un des éléments flexibles a ses marges perpendiculaires définies à auto, align-self sera ignoré.",
    "flex": "La propriété CSS <code>flex</code> est un raccourci permettant de définir les possibilités d'un élément flexible de remplir l'espace disponible.",
    "flex-basis": "La propriété CSS <code>flex-basis</code> définit la flexibilité de base qui est la taille principale initiale d'un élément flexible.",
    "flex-direction": "La propriété CSS <code>flex-direction</code> définit la manière dont les éléments flexibles sont placés dans leur conteneur en définissant l'axe principal et sa direction (normale ou inverse).",
    "flex-flow": "La propriété CSS <code>flex-flow</code> est un raccourci pour les propriétés individuelles flex-direction et flex-wrap.",
    "flex-grow": "La propriété CSS <code>flex-grow</code> définit le facteur d'agrandissement d'un élément flexible.",
    "flex-shrink": "La propriété CSS <code>flex-shrink</code> définit le facteur de réduction d'un élément flexible.",
    "flex-wrap": "La propriété CSS <code>flex-wrap</code> indique si les éléments enfants sont forcés sur une seule ligne ou s'ils peuvent déborder sur plusieurs lignes.",
    "justify-content": "La propriété CSS <code>justify-content</code> définit la manière dont un navigateur partage l'espace disponible entre et autour des éléments flexibles lors de leur alignement sur l'axe principal de la ligne utilisée."
}